       01 BOLETIM-LINHA.
           03 F-CABECALHO      PIC X(34).
           03 F-NOME           PIC X(30).
           03 F-MATERIA        PIC X(30).
           03 F-MEDIA          PIC X(10).
           03 F-STATUS         PIC X(20).
           03 F-RODAPE         PIC X(34).
           03 F-ID             PIC X(06).
